# IsEdgeHandle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstrainedHandle..::..IsEdgeHandle Method
RebarConstrainedHandle Class See Also
---
Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsEdgeHandle()
```

Visual Basic
---
```text
Public Function IsEdgeHandle As Boolean
```

Visual C++
---
```text
public:
bool IsEdgeHandle()
```

# See Also
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace